//COMPPROG JOB (ACCT),'COMPILA COBOL',CLASS=A,MSGCLASS=X,REGION=4096K
//* DELECAO
//DELSTEP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE CDICAS.TEST.LOADLIB(PROGDATA) MEMBER
//*
//* COMPILACAO
//DEMO1 EXEC COBUCL
//COB.SYSIN    DD DSN=CDICAS.COBOL1.SRC(PROGDATA),DISP=SHR
//LKED.SYSLMOD DD DSN=CDICAS.TEST.LOADLIB(PROGDATA),DISP=SHR
//LKED.SYSLIB  DD DSN=SYS1.COBLIB,DISP=SHR
//             DD DSN=SYS1.LINKLIB,DISP=SHR
//SYSPRINT     DD SYSOUT=A
//*
