       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEU-PROGRAMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MENSAGEM PIC X(50) VALUE "API COBOL funcionando!".
       
       PROCEDURE DIVISION.
           DISPLAY WS-MENSAGEM.
           STOP RUN.
