       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG015A.
       
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       working-storage section.

       01  WRK-NOME       PIC X(50) VALUE SPACES.
       01  WRK-TAMANHO    PIC 9(02) VALUE ZEROS.
       01  WRK-TAMANHO2    PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.

           MOVE '11111111BELO HORIZONTE, RIO DE JANEIRO' TO WRK-NOME
           DISPLAY 'NOME: ' WRK-NOME

           INSPECT FUNCTION REVERSE(WRK-NOME) TALLYING  WRK-TAMANHO 
                   FOR LEADING SPACES 

           DISPLAY 'QUANTIDADE DE ESPACOS DEPOIS: ' WRK-TAMANHO

           SUBTRACT LENGTH OF WRK-NOME FROM WRK-TAMANHO

           DISPLAY 'QUANTIDADE DE CARACTERES: ' WRK-TAMANHO


           INSPECT WRK-NOME TALLYING  WRK-TAMANHO2
                   FOR LEADING '1' 

           DISPLAY 'QUANTIDADE DE ESPACOS ANTES: ' WRK-TAMANHO2

           SUBTRACT WRK-TAMANHO FROM WRK-TAMANHO2

           DISPLAY 'QUANTIDADE DE CARACTERES FINAL: ' WRK-TAMANHO2


           STOP RUN. 

