       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG016A.
       
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       working-storage section.

       01  WRK-DATA.
         05 WRK-DATA-DIA       PIC 9(02) VALUE ZEROS.
         05 FILLER             PIC X(01) VALUE '/'.
         05 WRK-DATA-MES       PIC 9(02) VALUE ZEROS.
         05 FILLER             PIC X(01) VALUE '/'.
         05 WRK-DATA-ANO       PIC 9(04) VALUE ZEROS.

       01  WRK-TIME.
         05 WRK-TIME-HORA      PIC 9(02) VALUE ZEROS.
         05 FILLER             PIC X(01) VALUE ':'.
         05 WRK-TIME-MINUTO    PIC 9(02) VALUE ZEROS.


       COPY COD001A.

       PROCEDURE DIVISION.

           CALL 'PROGDATA' USING COD001A-REGISTRO

           DISPLAY 'DATA: ' COD001A-DATA

           MOVE COD001A-DATA(7:2) TO WRK-DATA-DIA
           MOVE COD001A-DATA(5:2) TO WRK-DATA-MES
           MOVE COD001A-DATA(1:4) TO WRK-DATA-ANO

           DISPLAY 'DATA DO DIA FORMATADO: ' WRK-DATA      

           DISPLAY 'DATA POR EXTENSO: HOJE E DIA '
           WRK-DATA-DIA ' DE 'COD001A-DESC-MES 'DE ' WRK-DATA-ANO.

           DISPLAY 'MES: ' COD001A-DESC-MES       
           DISPLAY 'SEMANA: ' COD001A-DESC-SEMANA 
           DISPLAY 'DIAS DO ANO: ' COD001A-DIAS-ANO

           CALL 'PROGTIME' USING COD001A-REGISTRO
           DISPLAY 'HORA: ' COD001A-TIME

           MOVE COD001A-TIME(1:2) TO WRK-TIME-HORA
           MOVE COD001A-TIME(3:2) TO WRK-TIME-MINUTO
           DISPLAY 'HORA FORMATADA: '     WRK-TIME

           DISPLAY 'PERIODO: ' COD001A-PERIODO

           STOP RUN.