      ******************************************************************
      * PROGRAMADOR: JOSE ROBERTO - COBOL DICAS
      * DATA.......: 23/03/2026
      * DESCRICAO..: CADASTRAR CLIENTES - TELA INICIAL
      * NOME.......: PROG033A
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG033A. 
      *================================================================*
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.  

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       
       01  WRK-OPCAO-MENU              PIC 9(002) VALUE ZEROS.        

      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
      *    PROCESSAMENTO PRINCIPAL
      *----------------------------------------------------------------*
      *> cobol-lint CL002 0000-processar
       0000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 0001-MENU-INICIAL 
           .
      *----------------------------------------------------------------*
      *> cobol-lint CL002 0000-end
       0000-END.                       EXIT.
      *----------------------------------------------------------------*


      *----------------------------------------------------------------*
      *    TELA MENU INICIAL
      *----------------------------------------------------------------*
       0001-MENU-INICIAL                  SECTION.
      *----------------------------------------------------------------*

           INITIALIZE WRK-OPCAO-MENU 

           DISPLAY '*=====================================*'
           DISPLAY '*         SISTEMA COBOL DICAS         *'
           DISPLAY '*-------------------------------------*'
           DISPLAY '* 1 - CADASTRAR CLIENTES              *'
           DISPLAY '* 2 - LISTA CLIENTES                  *'
           DISPLAY '* 3 - SAIR                            *'
           DISPLAY '*                                     *'
           DISPLAY '* ESCOLHA UM OPCAO : '
           WITH NO ADVANCING
           ACCEPT WRK-OPCAO-MENU 
           DISPLAY '*                                     *'
           DISPLAY '*=====================================*'
           
           EVALUATE WRK-OPCAO-MENU
            WHEN 1
                PERFORM 0002-CADASTRAR-CLIENTE
            WHEN 2
                PERFORM 0003-LISTAR-CLIENTE 
            WHEN 3
                PERFORM 9999-FINALIZAR
            WHEN OTHER
                DISPLAY 'OPCAO INVALIDA!'
                PERFORM 0001-MENU-INICIAL
           END-EVALUATE
           .
      *----------------------------------------------------------------*
      *> cobol-lint CL002 0001-end
       0001-END.                       EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *    CADASTRO DE CLIENTES
      *----------------------------------------------------------------*
       0002-CADASTRAR-CLIENTE          SECTION.
      *----------------------------------------------------------------*

           DISPLAY '*=====================================*'
           DISPLAY '*         CADASTRAR CLIENTES          *'
           DISPLAY '*-------------------------------------*'

           CALL 'PROG034A'
           .
      *----------------------------------------------------------------*
      *> cobol-lint CL002 0002-end
       0002-END.                       EXIT.
      *----------------------------------------------------------------*


      *----------------------------------------------------------------*
      *    EXIBE LISTA DE CLIENTES
      *----------------------------------------------------------------*
       0003-LISTAR-CLIENTE          SECTION.
      *----------------------------------------------------------------*

           DISPLAY '*=====================================*'
           DISPLAY '*           LISTAR CLIENTES           *'
           DISPLAY '*-------------------------------------*'

           CALL 'PROG035A'

           .
      *----------------------------------------------------------------*
      *> cobol-lint CL003 0003-end
      *> cobol-lint CL002 0003-end
       0003-END.                       EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *    FINALIZAR PROGRAMA
      *----------------------------------------------------------------*
      *> cobol-lint CL002 9999-finalizar
       9999-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*
           DISPLAY 'FIM DE PROGRAMA'
           STOP RUN 
           .           
      *----------------------------------------------------------------*
      *> cobol-lint CL002 9999-end
       9999-END.                       EXIT.
      *----------------------------------------------------------------*
