       TELABMS MAPSET
           DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,TIOAPFX=YES
           DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=FREEKB
           DFHMDF POS=(2,10),LENGTH=40,INITIAL='Digite seu nome:',ATTRB=(ASKIP,NORM)
           DFHMDF POS=(3,10),LENGTH=20,ATTRB=(UNPROT,NORM),FIELD=($NOME)
           DFHMSD TYPE=FINAL
       END